# <center> The Value of Data Pre-processing <center/>
<center> <b>DLBDSDQDW01<b/> - Data Quality and Data Wrangling <center/>
<center> IU International University of Applied Sciences <center/>

In this project, we tackle the challenges associated with analyzing real-world and messy datasets. Recognizing the inherent difficulties in seamlessly transitioning from hypothesis formulation to data analysis, this work emphasizes the importance of data cleaning, reshaping, and tidying as foundational steps in the analytical process. By applying Data Wrangling techniques and Quality methods, we aim to uncover patterns and insights, despite the noisy and incomplete nature of the data. This analysis not only highlights the relationships and trends within the dataset but also demonstrates the ability to effectively manage and interpret unstructured data, ultimately supporting informed decision-making.

## List of contents : 
1. __About the data__
2. __Overview__
3. __Exploraorty Data Analaysis__
4. __Data Wrangling__
5. __Data Quality Checks__
6. __Conclusion__

    About the Author

First, we start by importing the required libraries

In [1]:
# Import required libraries
from pathlib import Path
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd
import numpy as np

# 1. About the data

The [data](https://dax-cdn.cdn.appdomain.cloud/dax-airline/1.0.1/airline_2m.tar.gz) used in this notebook is only a sample from the original dataset called __The Reporting Carrier On-Time Performance Dataset__ containing information on approximately 200 million domestic US flights reported to the [United States Bureau of Transportation Statistics](https://www.bts.gov/). The dataset contains basic information about each flight (such as date, time, departure airport, arrival airport) and, if applicable, the amount of time the flight was delayed and information about the reason for the delay. A complete overview on the glossary of the data could be found [here](https://dax-cdn.cdn.appdomain.cloud/dax-airline/1.0.1/data-preview/index.html).

__NOTE__:Due to its large size, it's recommended to download it manually.

# 2. Overview

Some initial bullshit

Let's load our dataframe

In [7]:
# Locating our directory
path = Path.cwd()

# Read the airline data into pandas dataframe
df = pd.read_csv(f'{path.parent}/data/train.csv')

# Print the few first rows
df.head(15)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S

In [3]:
# Print the shape of the data
print(f"The dataset contains {df.shape[0]} rows and {df.shape[1]} columns.")

The dataset contains 891 rows and 12 columns.

In the following, we can see an overview of the data types, missing values, and columns of our dataset.

In [6]:
# Initiating a new dictionary
new_dict = {}

# Running a loop to gather information
for column in df.columns:
    new_dict[column] = [df[column].dtype, df[column].isna().sum(), df[column].unique(), len(df[column].unique())]

# Constructing the dataframe
discover_df = pd.DataFrame(new_dict).transpose().reset_index()
discover_df.columns = ["Columns", "Data types", "Number of empty values", "Unique Values", "Number of Unique Values"]

# Print the first few rows
discover_df

,Columns,Data types,Number of empty values,Unique Values,Number of Unique Values
0,PassengerId,int64,0,"[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14...",891
1,Survived,int64,0,"[0, 1]",2
2,Pclass,int64,0,"[3, 1, 2]",3
3,Name,object,0,"[Braund, Mr. Owen Harris, Cumings, Mrs. John B...",891
4,Sex,object,0,"[male, female]",2
5,Age,float64,177,"[22.0, 38.0, 26.0, 35.0, nan, 54.0, 2.0, 27.0,...",89
6,SibSp,int64,0,"[1, 0, 3, 4, 2, 5, 8]",7
7,Parch,int64,0,"[0, 1, 2, 5, 3, 4, 6]",7
8,Ticket,object,0,"[A/5 21171, PC 17599, STON/O2. 3101282, 113803...",681
9,Fare,float64,0,"[7.25, 71.2833, 7.925, 53.1, 8.05, 8.4583, 51....",248
10,Cabin,object,687,"[nan, C85, C123, E46, G6, C103, D56, A6, C23 C...",148
11,Embarked,object,2,"[S, C, Q, nan]",4

On this basis, let's proceed to delete the entirely empty columns

In [5]:
# Listing the empty columns
columns_to_drop = [
    # Redundant information
    "DOT_ID_Reporting_Airline",
    "IATA_CODE_Reporting_Airline",
    "OriginAirportID",
    "OriginAirportSeqID",
    "OriginCityMarketID",
    "OriginStateFips",
    "OriginWac",
    "DestAirportID",
    "DestAirportSeqID",
    "DestCityMarketID",
    "DestStateFips",
    "DestWac",
    "Div1AirportID",
    "Div1AirportSeqID",
    "Div1AirportID",
    "Div1AirportSeqID",

    # Empty columns
    "Div2Airport",
    "Div2AirportID",
    "Div2AirportSeqID",
    "Div2WheelsOn",
    "Div2TotalGTime",
    "Div2LongestGTime",
    "Div2WheelsOff",
    "Div2TailNum",
    "Div3Airport",
    "Div3AirportID",
    "Div3AirportSeqID",
    "Div3WheelsOn",
    "Div3TotalGTime",
    "Div3LongestGTime",
    "Div3WheelsOff",
    "Div3TailNum",
    "Div4Airport",
    "Div4AirportID",
    "Div4AirportSeqID",
    "Div4WheelsOn",
    "Div4TotalGTime",
    "Div4LongestGTime",
    "Div4WheelsOff",
    "Div4TailNum",
    "Div5Airport",
    "Div5AirportID",
    "Div5AirportSeqID",
    "Div5WheelsOn",
    "Div5TotalGTime",
    "Div5LongestGTime",
    "Div5WheelsOff",
    "Div5TailNum",
]

# Dropping the columns from the dataset
df.drop(columns_to_drop, axis=1, inplace=True)

# Adjusting columns with redundant information already in other columns
df['OriginCityName'] = df['OriginCityName'].str.split(',').str[0]
df['DestCityName'] = df['DestCityName'].str.split(',').str[0]

# Review the shape of the data
print(f"The resulting dataset contains {df.shape[0]} rows and {df.shape[1]} columns.")

The resulting dataset contains 2000000 rows and 63 columns.

The dataset covers two million flights during the period from __1987-10-01__ to __2020-03-31__. For the task, I'll be focusing on the data resulted in the last 2 decades.

In [6]:
# Slicing the data to cover the last 2 decades
df = df[(df["Year"] > 1998) & (df["Year"] < 2020)]

# Review the shape of the data
print(f"The resulting dataset contains {df.shape[0]} rows and {df.shape[1]} columns.")

The resulting dataset contains 1376877 rows and 63 columns.

In [7]:
# Saving the data for the dashboard
df.to_csv(f'{path.parent}/data/airline_data_v1.0.csv')

# That was it

So that was in short our way to create an interactive multi-chart dashboard based on two input variables